Revit 2027 API
ParameterFilterElement.AllRuleParametersApplicable(Document, ICollection<ElementId>, ElementFilter) Method
 Checks that the parameters of the given ElementFilter (representing a combination of rules) are valid for the given set of categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool AllRuleParametersApplicable(
	Document aDocument,
	ICollection<ElementId> categories,
	ElementFilter elementFilter
)
Public Shared Function AllRuleParametersApplicable (
	aDocument As Document,
	categories As ICollection(Of ElementId),
	elementFilter As ElementFilter
) As Boolean
public:
static bool AllRuleParametersApplicable(
	Document^ aDocument,
	ICollection<ElementId^>^ categories,
	ElementFilter^ elementFilter
)
static member AllRuleParametersApplicable :
        aDocument : Document *
        categories : ICollection<ElementId> *
        elementFilter : ElementFilter -> bool
Parameters
aDocument Document
 The document containing the filter, categories, and parameters involved in this validation.
categories ICollection<ElementId>
 The set of categories against which to check the rule parameters.
elementFilter ElementFilter
 The ElementFilter representing the combination of rules to check.
Return Value
Boolean
 True if all the parameters of the given rules are valid for this filter, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterElement Class
AllRuleParametersApplicable Overload
Autodesk.Revit.DB Namespace